Конфигурация отчетов/Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/Переоценка/Ext/ManagerModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьДокументПереоценки(ТЗ_ДанныеПереценки, ДатаДокумента) Экспорт  
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТЗ_ДанныеПереценки, "ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТЗ_ДанныеПереценки.Количество()=0 Тогда 
		Возврат;  
	КонецЕсли;
	
	Док = Документы.Переоценка.СоздатьДокумент();
	Док.Дата = ДатаДокумента;
	
	Для Каждого Данные Из ТЗ_ДанныеПереценки Цикл
		НоваяСтрока = Док.СписокТоваров.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Цена = Данные.Цена;
	КонецЦикла;
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Документ переоценки " + Док.Номер + " был успешено проведен!");
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Документ переоценки " + Док.Номер + " был успешено проведен!";
		//Сообщение.УстановитьДанные();
		//Сообщение.Сообщить();
	Исключение
		Сообщить("Не удалост провести документ переоценки по причине " + ОписаниеОшибки());
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Не удалост провести документ переоценки по причине " + ОписаниеОшибки();
		//Сообщение.УстановитьДанные();
		//Сообщение.Сообщить();     
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти
